---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ReferenceOtherViewUiRefView
source: html/7a13d664-3e49-81f2-da9c-e91e710cd038.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ReferenceOtherViewUiRefView Property

"Reference View": This is used by the UI to allow selection of view reference.

## Syntax (C#)
```csharp
public static ForgeTypeId ReferenceOtherViewUiRefView { get; }
```